---
title: MechanicalSystemType
classe: Autodesk.Revit.DB.Mechanical.MechanicalSystemType
namespace: Autodesk.Revit.DB.Mechanical
eredita: Autodesk.Revit.DB.MEPSystemType
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# MechanicalSystemType

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `RiseDropSymbol RiseDropSettings { get; set; }` | `mechanicalSystemType.RiseDropSettings` | RiseDropSymbol |
| `MechanicalSystemType Create(Document, MEPSystemClassification, String)` | `MechanicalSystemType.Create(ADoc, systemClassification, name)` | MechanicalSystemType |
| `Boolean ValidateRiseDropSymbolType(RiseDropSymbol)` | `mechanicalSystemType.ValidateRiseDropSymbolType(risedropType)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```